# ConfigurationReloadInfo Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConfigurationReloadInfo Properties
ConfigurationReloadInfo Class See Also
---
The ConfigurationReloadInfo type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Disconnects | The number of disconnections caused by the reload. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| OutOfDatePartCount | The number of fabrication part instances that had newer versions and were out of date. |
| ProfileNotAvailable | The current profile is not available in the disk configuration. |

# See Also
ConfigurationReloadInfo Class
Autodesk.Revit.DB Namespace